In [2]:
import pandas as pd
import numpy as np

In [3]:
two_dimensional_list = [
    ['skirt', 10, 30000],
    ['sweater', 15, 60000],
    ['coat', 6, 95000],
    ['jeans', 11, 35000]
]
two_dimensional_array = np.array(two_dimensional_list)

list_df = pd.DataFrame(two_dimensional_list)
array_df = pd.DataFrame(two_dimensional_array)

In [4]:
list_df

         0   1      2
0    skirt  10  30000
1  sweater  15  60000
2     coat   6  95000
3    jeans  11  35000

In [5]:
array_df

         0   1      2
0    skirt  10  30000
1  sweater  15  60000
2     coat   6  95000
3    jeans  11  35000

In [6]:
dict_df = pd.DataFrame({
    'category': ['skirt', 'sweater', 'coat', 'jeans'],
    'quantity': [10, 15, 6, 11],                                     
    'price': [30000, 60000, 95000, 35000]
})

dict_df

  category  quantity  price
0    skirt        10  30000
1  sweater        15  60000
2     coat         6  95000
3    jeans        11  35000

In [7]:
list_df = pd.DataFrame(two_dimensional_list, columns=['category', 'quantity', 'price'])
array_df = pd.DataFrame(two_dimensional_array, columns=['category', 'quantity', 'price'])

In [8]:
list_df
array_df

  category quantity  price
0    skirt       10  30000
1  sweater       15  60000
2     coat        6  95000
3    jeans       11  35000

In [9]:
dict_list = [
    {'category': 'skirt', 'quantity': 10, 'price': 30000},
    {'category': 'sweator', 'quantity': 15, 'price': 60000},
    {'category': 'coat', 'quantity': 6, 'price': 95000},
    {'category': 'jeans', 'quantity': 11, 'price': 35000}
]

dict_list_df = pd.DataFrame(dict_list)

In [10]:
dict_list_df

  category  quantity  price
0    skirt        10  30000
1  sweator        15  60000
2     coat         6  95000
3    jeans        11  35000